stm32-hotspot/STM32WB-BLE-EncryptedAdvertising/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_p2pClient_EAD_Ext/STM32_WPAN/App/app_ble.c
        case HCI_LE_ADVERTISING_REPORT_SUBEVT_CODE:
        {
          /* USER CODE BEGIN EVT_LE_ADVERTISING_REPORT */

          /* USER CODE END EVT_LE_ADVERTISING_REPORT */

        }
          break;
        case HCI_LE_EXTENDED_ADVERTISING_REPORT_SUBEVT_CODE:
        { 
          ext_adv_evt = (hci_le_extended_advertising_report_event_rp0 *) meta_evt->data;
          
          if ((disp_filter != 0) && HAL_IS_BIT_SET(ext_adv_evt->Event_Type, 0x0010))
          {
            break;
          }
          
          l_buff_pos = 0;
          memset(&l_buff[l_buff_pos], 0, L_BUFF_SIZE);          

          l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, 
                                  "%02x:%02x:%02x:%02x:%02x:%02x | "
                                  ,ext_adv_evt->Address[5], ext_adv_evt->Address[4]
                                  ,ext_adv_evt->Address[3] ,ext_adv_evt->Address[2]
                                  ,ext_adv_evt->Address[1] ,ext_adv_evt->Address[0]);
          
          if (HAL_IS_BIT_SET(ext_adv_evt->Event_Type, 0x0010))
          {
            l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE, "LEGACY   |");
          }
          else
          {
            l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE, "EXTENDED |");
          }
          
          l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "%4d | ",(int8_t)ext_adv_evt->RSSI );
                    
          if (HAL_IS_BIT_SET(ext_adv_evt->Event_Type, 0x0001))
          {
            l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "CONN |");
          }
          else
          {
            l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "     |");
          }
          
          if (HAL_IS_BIT_SET(ext_adv_evt->Event_Type, 0x0002))
          {
            if (HAL_IS_BIT_SET(ext_adv_evt->Event_Type, 0x0008))
            {
              l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "SCAN RSP |");
            }
            else
            {
              l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "SCAN     |");
            }
          }
          else
          {
            l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "         |");
          }
          
          l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "%3d | ",ext_adv_evt->Data_Length );
          
          if (ext_adv_evt->Advertising_SID != 0xFF)
          {
            l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "%2d | ",ext_adv_evt->Advertising_SID );
          }
          
          if (HAL_IS_BIT_SET(ext_adv_evt->Event_Type, 0x0020))
          {
            l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "more data   | ");
          }
          else if (HAL_IS_BIT_SET(ext_adv_evt->Event_Type, 0x0040))
          {
            l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "trunc data | ");
          }
          else
          {
            /* Nothing to do */
          }          

          k = 0;
          while ( k < ext_adv_evt->Data_Length )
          {
            adlength = ext_adv_evt->Data[k];
            adtype = ext_adv_evt->Data[k + 1];
            /* get encrypted advertising data */
            if ( adtype == AD_TYPE_ENCRYPTED_ADV_DATA)
            {
              uint16_t j;
              APP_DBG_MSG("  \r\n");
              APP_DBG_MSG("  === encrypted data received \n");
              APP_DBG_MSG("  \r\n");
              BleApplicationContext.EAD_found = 1;
              BleApplicationContext.EAD_length = adlength;

              for (j=0;j<BleApplicationContext.EAD_length - 1;j++)
              {
                BleApplicationContext.EAD_data[j] = ext_adv_evt->Data[j+k+2];
              }
              /* call decryption function */

              if (BleApplicationContext.DeviceAlreadyBonded)
              {
                APP_DBG_MSG("  === Use of encryption key stored in Flash \n");
                result = aci_hal_ead_encrypt_decrypt(0x01, restored_key, restored_iv, adlength - 1, BleApplicationContext.EAD_data, &Out_Data_Length, Out_Data);
              }
              else
              {
                APP_DBG_MSG("  === Use of encryption key stored in RAM \n");
                result = aci_hal_ead_encrypt_decrypt(0x01, encryption_key, initialization_vector, adlength - 1, BleApplicationContext.EAD_data, &Out_Data_Length, Out_Data);
              }
              if (result != BLE_STATUS_SUCCESS)
              {
                APP_DBG_MSG("  === Fail   : aci_hal_ead_encrypt_decrypt, result: 0x%02X\n", result);
                APP_DBG_MSG("  === expected at first connection if devices not bonded \r\n");
                APP_DBG_MSG("  \r\n");
              }
              else
              {
                APP_DBG_MSG("  === Success: aci_hal_ead_encrypt_decrypt\n");
                APP_DBG_MSG("  \r\n");
              } 
            }  
            if ( adtype == AD_TYPE_MANUFACTURER_SPECIFIC_DATA )
            {
              if ( (adlength >= 7) && (ext_adv_evt->Data[k + 2] == 0x01) )
              {
                if (ext_adv_evt->Data[k + 3] == CFG_DEV_ID_P2P_EADS)
                {
                  if ( HAL_IS_BIT_CLR(ext_adv_evt->Event_Type, 0x0010) && 
                        HAL_IS_BIT_SET(ext_adv_evt->Event_Type, 0x0001))
                  {
                    l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "server detected via MAN ID, address recorded to connect. | ");
                    BleApplicationContext.DeviceServerFound = 0x01;
                    ext_adv_server_remote_bd_addr[0] = ext_adv_evt->Address[0];
                    ext_adv_server_remote_bd_addr[1] = ext_adv_evt->Address[1];
                    ext_adv_server_remote_bd_addr[2] = ext_adv_evt->Address[2];
                    ext_adv_server_remote_bd_addr[3] = ext_adv_evt->Address[3];
                    ext_adv_server_remote_bd_addr[4] = ext_adv_evt->Address[4];
                    ext_adv_server_remote_bd_addr[5] = ext_adv_evt->Address[5];
                    ext_adv_address_type = ext_adv_evt->Address_Type;
                    
                    BleApplicationContext.deviceServerFound = 0x01;
                    Scan_Terminate();
                  }
                }
              }
            }
            else if(adtype == AD_TYPE_COMPLETE_LOCAL_NAME)
            {
              memcpy(&l_buff[l_buff_pos], &ext_adv_evt->Data[k + 2], adlength - 1);
              l_buff_pos += adlength - 1;
            }
            k += adlength + 1;
          }
          l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "\n");
          
